Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: open my $barfh, '>:encoding(BAR)', 'example.bar.txt';
es: open my $fh_B, '>:encoding(B)', 'ejemplo.B.txt';

source: open my $fh, "@_" or die "Can't open '@_': $!";
es: open my $archivo, "@_" or die "No puedo abrir '@_': $!";

source: open my $fh, '<:encoding(UTF-8)', $filename; # auto decoding on read
es: open my $fh, '<:encoding(UTF-8)', $archivo; # descodificación automática al leer

source: open my $fh, '>', $self->path() or die $!;
es: open my $archivo, '>', $self->ruta() or die $!;

source: open my $fh, '>', 'path/to/file';
es: open my $archivo, '>', 'ruta/de/archivo';

source: open my $fh, '>:encoding(UTF-8)', $filename; # auto encoding on write
es: open my $fh, '>:encoding(UTF-8)', $archivo; # codificación automática al escribir

source: open my $foofh, '<:encoding(FOO)', 'example.foo.txt';
es: open my $fh_A, '<:encoding(A)', 'ejemplo.A.txt';

source: open my $logfile, ">>", "my.log" or die "Could not open my.log: $!";
es: open my $registro, ">>", "mi.registro" or die "No se pudo abrir mi.registro: $!";

source: open(FOO,$foo) || die "Can't open $foo: $!";
es: open(FOO,$foo) || die "No se puede abrir $foo: $!";

source: open(my $in, "<", "input.txt") or die "Can't open input.txt: $!";
es: open(my $entrada, "<", "entrada.txt") or die "No se puede abrir entrada.txt: $!";

source: open(my $log, ">>", "my.log") or die "Can't open my.log: $!";
es: open(my $registro, ">>", "mi.registro") or die "No se puede abrir mi.registro: $!";

source: open(my $out, ">", "output.txt") or die "Can't open output.txt: $!";
es: open(my $salida, ">", "salida.txt" ) or die "No se puede abrir salida.txt: $!";

source: opendir(D, $dir) or die "can't opendir $dir: $!";
es: opendir(D, $dir) or die "No se puede ejecutar opendir $dir: $!";

source: or
es: o bien

source: or by letting automatic decoding and encoding do all the work:
es: o dejar que la descodificación y la codificación automáticas se encarguen de hacer la conversión:

source: or by skipping the text string part, and going directly from one binary encoding to the other:
es: También puede omitir la parte de la cadena de texto y pasar directamente de una codificación binaria a otra:

# or die "Cannot open $filename: $! ";
source: or die "Cannot open $filename: $!\n";
es: or die "No se puede abrir $archivo: $!\n";

source: or for initializing hash references to be used as records:
es: o para inicializar referencias de hash que se usarán como registros:

source: or for using call-by-named-parameter to complicated functions:
es: o para utilizar llamadas mediante parámetros con nombre para funciones complicadas:

source: or perhaps as a real reference, like this:
es: o tal vez como una referencia real, de esta manera:

source: or the loop implied by split().
es: o el bucle implícito de split().

source: or the pumpkineer (pulling the strings?).
es: o I<pumpkineer> (¿por ser el que mueve los hilos?).

source: or this:
es: o bien:

source: or xor \z string end /g global () capture /o compile pat once
es: or xor \z fin cadena /g global () capturar /o compilar patrón una vez

source: or, for zipped modules, type
es: o bien, para módulos comprimidos, escriba

source: our $stuff = '';
es: our $cosa = '';

source: our %Hashit = ();
es: our %Hash1 = ();

source: our @EXPORT_OK = qw($Var1 %Hashit func3);
es: our @EXPORT_OK = qw($Var1 %Hash1 func3);

source: our @more = ();
es: our @otras = ();

source: outputs
es: produce como salida:

source: overload::constant 'qr' => \&convert;
es: overload::constant 'qr' => \&convertir;

source: package Child;
es: package Hijo;

source: package File::MP3;
es: package Archivo::MP3;

source: package File;
es: package Archivo;

source: package HasOnOfSwitch;
es: package TieneInterruptor;

source: package MultiChild;
es: package VariosHijos;

source: package MyMaths;
es: package MisOperadores;

source: package Some::Module; # assumes Some/Module.pm
es: package Mi::Modulo; # se supone que está en Mi/Modulo.pm

source: package Some_package;
es: package Un_paquete;

source: package Time;
es: package Hora;

source: package customre;
es: package rxpersonal;

source: package myint;
es: package entero;

source: path => '/etc/hostname',
es: ruta => '/etc/hostname',

source: path => 'mp3s/My-Body-Is-a-Cage.mp3',
es: ruta => 'mp3/Soy-minero.mp3',

source: pattern.
es: patrón.

source: pax -o to=IBM-1047,from=ISO8859-1 -r < yourmodule.tar
es: pax -o to=IBM-1047,from=ISO8859-1 -r < mimodulo.tar

source: perl Perl overview (this section)
es: perl Información general sobre Perl (esta sección)

source: perl - The Perl 5 language interpreter
es: perl - El intérprete del lenguaje Perl 5

source: perl -V:ivsize (?|p|p)branch reset \h horiz.wh.space (?&NM) cap to name \R linebreak \S \W \D \H negate
es: perl -V:ivsize (?|p|p) reinicio bifurcación \h espacio en blanco horiz. (?<NM>) capturar en nombre \R salto de línea \S \W \D \H negar

source: perl -i.bak -pe 's/(?:\015)?\012/\015/g' <filenames>
es: perl -i.bak -pe 's/(?:\015)?\012/\015/g' <nombres de los archivos>

source: perl Makefile.PL PREFIX=/my/perl_directory
es: perl Makefile.PL PREFIX=/mi/directorio_perl

source: perl progname.pl
es: perl nombre_programa.pl

source: perl sets C<$^X> where possible to a full path by asking the operating system.
es: Siempre que es posible, perl establece como valor de C<$^X> una ruta completa; para ello, consulta al sistema operativo.

source: perl.org?
es: ¿Y perl.org?

source: perl5004delta Perl changes in version 5.004
es: perl5004delta Cambios en la versión 5.004

source: perl5005delta Perl changes in version 5.005
es: perl5005delta Cambios en la versión 5.005

source: perl5100delta Perl changes in version 5.10.0
es: perl5100delta Cambios en la versión 5.10.0

source: perl5101delta Perl changes in version 5.10.1
es: perl5101delta Cambios en la versión 5.10.1

source: perl5110delta Perl changes in version 5.11.0
es: perl5110delta Cambios en la versión 5.11.0

source: perl5111delta Perl changes in version 5.11.1
es: perl5111delta Cambios en la versión 5.11.1

source: perl5112delta Perl changes in version 5.11.2
es: perl5112delta Cambios en la versión 5.11.2

source: perl5113delta Perl changes in version 5.11.3
es: perl5113delta Cambios en la versión 5.11.3

source: perl5114delta Perl changes in version 5.11.4
es: perl5114delta Cambios en la versión 5.11.4

source: perl5115delta Perl changes in version 5.11.5
es: perl5115delta Cambios en la versión 5.11.5

source: perl5120delta Perl changes in version 5.12.0
es: perl5120delta Cambios en la versión 5.12.0

source: perl5121delta Perl changes in version 5.12.1
es: perl5121delta Cambios en la versión 5.12.1

source: perl5122delta Perl changes in version 5.12.2
es: perl5122delta Cambios en la versión 5.12.2

source: perl5123delta Perl changes in version 5.12.3
es: perl5123delta Cambios en la versión 5.12.3

source: perl5130delta Perl changes in version 5.13.0
es: perl5130delta Cambios en la versión 5.13.0

source: perl51310delta Perl changes in version 5.13.10
es: perl51310delta Cambios en la versión 5.13.10

source: perl51311delta Perl changes in version 5.13.11
es: perl51311delta Cambios en la versión 5.13.11

source: perl5131delta Perl changes in version 5.13.1
es: perl5131delta Cambios en la versión 5.13.1

source: perl5132delta Perl changes in version 5.13.2
es: perl5132delta Cambios en la versión 5.13.2

source: perl5133delta Perl changes in version 5.13.3
es: perl5133delta Cambios en la versión 5.13.3

source: perl5134delta Perl changes in version 5.13.4
es: perl5134delta Cambios en la versión 5.13.4

source: perl5135delta Perl changes in version 5.13.5
es: perl5135delta Cambios en la versión 5.13.5

source: perl5136delta Perl changes in version 5.13.6
es: perl5136delta Cambios en la versión 5.13.6

source: perl5137delta Perl changes in version 5.13.7
es: perl5137delta Cambios en la versión 5.13.7

source: perl5138delta Perl changes in version 5.13.8
es: perl5138delta Cambios en la versión 5.13.8

source: perl5139delta Perl changes in version 5.13.9
es: perl5139delta Cambios en la versión 5.13.9

source: perl5140delta Perl changes in version 5.14.0
es: perl5140delta Cambios en la versión 5.14.0

source: perl561delta Perl changes in version 5.6.1
es: perl561delta Cambios en la versión 5.6.1

source: perl56delta Perl changes in version 5.6
es: perl56delta Cambios en la versión 5.6

source: perl570delta Perl changes in version 5.7.0
es: perl570delta Cambios en la versión 5.7.0

source: perl571delta Perl changes in version 5.7.1
es: perl571delta Cambios en la versión 5.7.1

source: perl572delta Perl changes in version 5.7.2
es: perl572delta Cambios en la versión 5.7.2

source: perl573delta Perl changes in version 5.7.3
es: perl573delta Cambios en la versión 5.7.3

source: perl581delta Perl changes in version 5.8.1
es: perl581delta Cambios en la versión 5.8.1

source: perl582delta Perl changes in version 5.8.2
es: perl582delta Cambios en la versión 5.8.2

source: perl583delta Perl changes in version 5.8.3
es: perl583delta Cambios en la versión 5.8.3

source: perl584delta Perl changes in version 5.8.4
es: perl584delta Cambios en la versión 5.8.4

source: perl585delta Perl changes in version 5.8.5
es: perl585delta Cambios en la versión 5.8.5

source: perl586delta Perl changes in version 5.8.6
es: perl586delta Cambios en la versión 5.8.6

source: perl587delta Perl changes in version 5.8.7
es: perl587delta Cambios en la versión 5.8.7

source: perl588delta Perl changes in version 5.8.8
es: perl588delta Cambios en la versión 5.8.8

source: perl589delta Perl changes in version 5.8.9
es: perl589delta Cambios en la versión 5.8.9

source: perl58delta Perl changes in version 5.8.0
es: perl58delta Cambios en la versión 5.8.0

source: perl590delta Perl changes in version 5.9.0
es: perl590delta Cambios en la versión 5.9.0

source: perl591delta Perl changes in version 5.9.1
es: perl591delta Cambios en la versión 5.9.1

source: perl592delta Perl changes in version 5.9.2
es: perl592delta Cambios en la versión 5.9.2

source: perl593delta Perl changes in version 5.9.3
es: perl593delta Cambios en la versión 5.9.3

source: perl594delta Perl changes in version 5.9.4
es: perl594delta Cambios en la versión 5.9.4

source: perl595delta Perl changes in version 5.9.5
es: perl595delta Cambios en la versión 5.9.5

source: perlaix Perl notes for AIX
es: perlaix Notas para AIX

source: perlamiga Perl notes for AmigaOS
es: perlamiga Notas para AmigaOS

source: perlapi Perl API listing (autogenerated)
es: perlapi Lista de API

source: perlapio Perl internal IO abstraction interface
es: perlapio Interfaz de abstracción de E/S interna

source: perlartistic Perl Artistic License
es: perlartistic Licencia Artistic de Perl

source: perlbeos Perl notes for BeOS
es: perlbeos Notas para BeOS

source: perlbook Perl book information
es: perlbook Información de libros sobre Perl

source: perlbook - Books about and related to Perl
es: perlbook - Libros sobre Perl y otros libros relacionados

source: perlboot Perl OO tutorial for beginners
es: perlboot Programación orientada a objetos para principiantes

source: perlboot - This document has been deleted
es: perlboot - Documento suprimido

source: perlbot Perl OO tricks and examples
es: perlbot Trucos y ejemplos de POO

source: perlbot - This document has been deleted
es: perlbot - Documento suprimido

source: perlbs2000 Perl notes for POSIX-BC BS2000
es: perlbs2000 Notas para POSIX-BC BS2000

source: perlcall Perl calling conventions from C
es: perlcall Convenciones de llamada desde C

source: perlce Perl notes for WinCE
es: perlce Notas para WinCE

source: perlcheat Perl cheat sheet
es: perlcheat Referencia rápida de Perl

source: perlcheat - Perl 5 Cheat Sheet
es: perlcheat - Hoja resumen de Perl 5

source: perlclib Internal replacements for standard C library functions
es: perlclib Sustitutos internos de funciones de la biblioteca estándar de C

source: perlclib - Internal replacements for standard C library functions
es: perlclib - Sustitutos internos de funciones de la biblioteca estándar de C

source: perlcn Perl for Simplified Chinese (in EUC-CN)
es: perlcn Perl para chino simplificado (en EUC-CN)

source: perlcommunity Perl community information
es: perlcommunity Información sobre la comunidad Perl

source: perlcommunity - a brief overview of the Perl community
es: perlcommunity - Breve descripción de la comunidad Perl

source: perlcompile Perl compiler suite intro
es: perlcompile Herramientas de compilación de Perl

source: perlcygwin Perl notes for Cygwin
es: perlcygwin Notas para Cygwin

source: perldata Perl data structures
es: perldata Estructuras de datos

source: perldata - Perl data types
es: perldata - Tipos de datos de Perl

source: perldbmfilter Perl DBM filters
es: perldbmfilter Filtros DBM

source: perldbmfilter - Perl DBM Filters
es: perldbmfilter - Filtros DBM de Perl

source: perldebguts Perl debugging guts and tips
es: perldebguts Componentes y consejos para la depuración

source: perldebtut Perl debugging tutorial
es: perldebtut Tutorial de depuración

source: perldebug Perl debugging
es: perldebug Depuración

source: perldelta Perl changes since previous version
es: perldelta Cambios con respecto a la versión anterior

source: perldgux Perl notes for DG/UX
es: perldgux Notas para DG/UX

source: perldiag Perl diagnostic messages
es: perldiag Mensajes de diagnóstico

source: perldoc Look up Perl documentation in Pod format
es: perldoc Consulta de la documentación de Perl en formato Pod

source: perldoc - Look up Perl documentation in Pod format.
es: perldoc - Consultar la documentación de Perl en formato Pod.

source: perldos Perl notes for DOS
es: perldos Notas para DOS

source: perldsc Perl data structures intro
es: perldsc Introducción a las estructuras de datos

source: perlebcdic Considerations for running Perl on EBCDIC platforms
es: perlebcdic Ejecución de Perl en plataformas EBCDIC

source: perlembed Perl ways to embed perl in your C or C++ application
es: perlembed Formas de integrar Perl en una aplicación C o C++

source: perlepoc Perl notes for EPOC
es: perlepoc Notas para EPOC

source: perlexperiment - A listing of experimental features in Perl
es: perlexperiment - Lista de funcionalidades experimentales de Perl

source: perlfaq Perl frequently asked questions
es: perlfaq Preguntas más frecuentes

source: perlfaq1 General Questions About Perl
es: perlfaq1 Preguntas generales sobre Perl

source: perlfaq1 - General Questions About Perl
es: perlfaq1 - Preguntas generales sobre Perl

source: perlfaq2 Obtaining and Learning about Perl
es: perlfaq2 Cómo obtener y aprender a utilizar Perl

source: perlfaq2 - Obtaining and Learning about Perl
es: perlfaq2 - Cómo obtener Perl y dónde buscar información sobre Perl

source: perlfaq3 Programming Tools
es: perlfaq3 Herramientas de programación

source: perlfaq4 Data Manipulation
es: perlfaq4 Manipulación de datos

source: perlfaq5 Files and Formats
es: perlfaq5 Archivos y formatos

source: perlfaq6 Regexes
es: perlfaq6 Expresiones regulares

source: perlfaq7 Perl Language Issues
es: perlfaq7 Problemas del lenguaje Perl

source: perlfaq8 System Interaction
es: perlfaq8 Interacción con el sistema

source: perlfaq9 Networking
es: perlfaq9 Conexión a redes

source: perlfilter Perl source filters
es: perlfilter Filtros de código fuente

source: perlfork Perl fork() information
es: perlfork Información sobre fork()

source: perlform Perl formats
es: perlform Formatos

source: perlfreebsd Perl notes for FreeBSD
es: perlfreebsd Notas para FreeBSD

source: perlfreebsd - Perl version 5 on FreeBSD systems
es: perlfreebsd - Perl versión 5 en sistemas FreeBSD

source: perlfunc Perl built-in functions
es: perlfunc Funciones predefinidas

source: perlgit Using git with the Perl repository
es: perlgit Uso de git con el repositorio de Perl

source: perlgit - Detailed information about git and the Perl repository
es: perlgit - Información detallada sobre git y el repositorio de Perl

source: perlglossary Perl Glossary
es: perlglossary Glosario

source: perlglossary - Perl Glossary
es: perlglossary - Glosario de Perl

source: perlgpl GNU General Public License
es: perlgpl Licencia GNU General Public License

source: perlguts Perl internal functions for those doing extensions
es: perlguts Funciones internas para crear extensiones

source: perlhack Perl hackers guide
es: perlhack Guía para hackers

source: perlhacktips Tips for Perl core C code hacking
es: perlhacktips Consejos para modificar el código C del núcleo de Perl

source: perlhacktut Walk through the creation of a simple C code patch
es: perlhacktut Tutorial de creación de un parche sencillo de código C

source: perlhacktut - Walk through the creation of a simple C code patch
es: perlhacktut - Tutorial de creación de un parche sencillo de código C

source: perlhaiku Perl notes for Haiku
es: perlhaiku Notas para Haiku

source: perlhist Perl history records
es: perlhist Registros históricos de Perl

source: perlhist - the Perl history records
es: perlhist - Registro histórico de versiones de Perl

source: perlhpux Perl notes for HP-UX
es: perlhpux Notas para HP-UX

source: perlhurd Perl notes for Hurd
es: perlhurd Notas para Hurd

source: perlhurd - Perl version 5 on Hurd
es: perlhurd - Perl versión 5 en Hurd

source: perlintern Perl internal functions (autogenerated)
es: perlintern Funciones internas de Perl

source: perlinterp Overview of the Perl intepreter source and how it works
es: perlinterp Descripción del código fuente y el funcionamiento del intérprete de Perl

source: perlintro Perl introduction for beginners
es: perlintro Introducción a Perl para principiantes

source: perlintro -- a brief introduction and overview of Perl
es: perlintro -- Breve introducción y descripción general de Perl

source: perliol C API for Perl's implementation of IO in Layers
es: perliol API en C para implementar en Perl las capas de E/S

source: perlipc Perl interprocess communication
es: perlipc Comunicación entre procesos

source: perlirix Perl notes for Irix
es: perlirix Notas para Irix

source: perljp Perl for Japanese (in EUC-JP)
es: perljp Perl para japonés (en EUC-JP)

source: perlko Perl for Korean (in EUC-KR)
es: perlko Perl para coreano (en EUC-KR)

source: perllexwarn Perl warnings and their control
es: perllexwarn Advertencias y control de advertencias

source: perllinux Perl notes for Linux
es: perllinux Notas para Linux

source: perllocale Perl locale support
es: perllocale Compatibilidad con la configuración regional

source: perllol Perl data structures: arrays of arrays
es: perllol Estructuras de datos: arrays de arrays

source: perlmacos Perl notes for Mac OS (Classic)
es: perlmacos Notas para Mac OS (Classic)

source: perlmacosx Perl notes for Mac OS X
es: perlmacosx Notas para Mac OS X

source: perlmod Perl modules: how they work
es: perlmod Funcionamiento de un módulo Perl

source: perlmod - Perl modules (packages and symbol tables)
es: perlmod - Módulos Perl (paquetes y tablas de símbolos)

source: perlmodinstall Perl modules: how to install from CPAN
es: perlmodinstall Instalación de módulos de CPAN

source: perlmodinstall - Installing CPAN Modules
es: perlmodinstall - Instalación de módulos de CPAN

source: perlmodlib Perl modules: how to write and use
es: perlmodlib Programación y utilización de módulos Perl

source: perlmodstyle Perl modules: how to write modules with style
es: perlmodstyle Cómo programar módulos Perl con estilo

source: perlmpeix Perl notes for MPE/iX
es: perlmpeix Notas para MPE/iX

source: perlmroapi Perl method resolution plugin interface
es: perlmroapi Interfaz de complementos: resolución de métodos

source: perlmroapi - Perl method resolution plugin interface
es: perlmroapi - Interfaz del complemento de resolución de métodos de Perl

source: perlnetware Perl notes for NetWare
es: perlnetware Notas para NetWare

source: perlnewmod Perl modules: preparing a new module for distribution
es: perlnewmod Preparar la distribución de un módulo Perl nuevo

source: perlnewmod - preparing a new module for distribution
es: perlnewmod - Preparar la distribución de un módulo nuevo

source: perlnumber Perl number semantics
es: perlnumber Semántica de números

source: perlnumber - semantics of numbers and numeric operations in Perl
es: perlnumber - Semántica de números y operaciones numéricas en Perl

source: perlobj Perl objects
es: perlobj Objetos

source: perlobj - Perl object reference
es: perlobj - Referencia de objetos en Perl

source: perlootut - Object-Oriented Programming in Perl Tutorial
es: perlootut - Manual de programación orientada a objetos en Perl

source: perlop Perl operators and precedence
es: perlop Operadores y precedencia

source: perlopenbsd Perl notes for OpenBSD
es: perlopenbsd Notas para OpenBSD

source: perlopenbsd - Perl version 5 on OpenBSD systems
es: perlopenbsd - Perl versión 5 en sistemas OpenBSD

source: perlopentut Perl open() tutorial
es: perlopentut Tutorial de open()

source: perlos2 Perl notes for OS/2
es: perlos2 Notas para OS/2

source: perlos390 Perl notes for OS/390
es: perlos390 Notas para OS/390

source: perlos400 Perl notes for OS/400
es: perlos400 Notas para OS/400

source: perlpacktut Perl pack() and unpack() tutorial
es: perlpacktut Tutorial de pack() y unpack()

source: perlperf Perl Performance and Optimization Techniques
es: perlperf Rendimiento y técnicas de optimización

source: perlplan9 Perl notes for Plan 9
es: perlplan9 Notas para Plan 9

source: perlpod Perl plain old documentation
es: perlpod Documentación en texto simple (POD)

source: perlpodspec Perl plain old documentation format specification
es: perlpodspec Especificación del formato POD

source: perlpodstyle Perl POD style guide
es: perlpodstyle Guía de estilo para POD

source: perlpolicy Perl development policies
es: perlpolicy Directivas de desarrollo de Perl

source: perlport Perl portability guide
es: perlport Guía de portabilidad

source: perlpragma Perl modules: writing a user pragma
es: perlpragma Programación de un pragma de usuario

source: perlpragma - how to write a user pragma
es: perlpragma - Crear un pragma de usuario

source: perlqnx Perl notes for QNX
es: perlqnx Notas para QNX

source: perlre Perl regular expressions, the rest of the story
es: perlre Expresiones regulares: el resto de la historia

source: perlre - Perl regular expressions
es: perlre - Expresiones regulares en Perl

source: perlreapi Perl regular expression plugin interface
es: perlreapi Interfaz de complementos: expresiones regulares

source: perlrebackslash Perl regular expression backslash sequences
es: perlrebackslash Secuencias de escape en expresiones regulares

source: perlrecharclass Perl regular expression character classes
es: perlrecharclass Clases de caracteres en expresiones regulares

source: perlref Perl references, the rest of the story
es: perlref Referencias: el resto de la historia

source: perlreftut Perl references short introduction
es: perlreftut Breve introducción a las referencias

source: perlreguts Perl regular expression engine internals
es: perlreguts Componentes del motor de expresiones regulares

source: perlrequick Perl regular expressions quick start
es: perlrequick Guía rápida de las expresiones regulares

source: perlreref Perl regular expressions quick reference
es: perlreref Referencia rápida de expresiones regulares

source: perlretut Perl regular expressions tutorial
es: perlretut Tutorial de expresiones regulares

source: perlriscos Perl notes for RISC OS
es: perlriscos Notas para RISC OS

source: perlrun Perl execution and options
es: perlrun Ejecución y opciones de ejecución

source: perlsec Perl security
es: perlsec Seguridad

source: perlsolaris Perl notes for Solaris
es: perlsolaris Notas para Solaris

source: perlsource Guide to the Perl source tree
es: perlsource Guía del árbol de código fuente
